# OnInstanceEnd Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
IExportContext..::..OnInstanceEnd Method
IExportContext Interface See Also
---
This method marks the end of a family instance being exported.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2014
# Syntax
C#
---
```text
void OnInstanceEnd(
	InstanceNode node
)
```

Visual Basic
---
```text
Sub OnInstanceEnd ( _
	node As InstanceNode _
)
```

Visual C++
---
```text
void OnInstanceEnd(
	InstanceNode^ node
)
```

# ### Parameters
node
    Type: Autodesk.Revit.DB..::..InstanceNode An output node that represents a family instance.
# See Also
IExportContext Interface
Autodesk.Revit.DB Namespace